#include <stdio.h>

typedef enum {
    	START,
    	UNTIL_9
} state;

int main() {
	state current = START;
    	while (1) {
        	switch (current) {
            		case START: {
                		printf("\nՍիրելի՛ ընթերցող, քեզ ենք ներկայացնում մեր նախագիծը, որը քեզ թույլ կտա փոփոխություններ կատարել Վահան Թոթովենցի «Աղավնիներ» վիպակի մեջ՝ ստեղծելով «Աղավնիների» քո տարբերակը։\n\n");
                		printf("Պատրա՞ստ ես։ Սեղմի՛ր ցանկացած ստեղն խաղը սկսելու համար\n\n");
                
                		char a;
                		scanf(" %c", &a);
                		current = UNTIL_9;
               			break;
            		}

            		case UNTIL_9: {
                		printf("\n\n\nԸնթերցողի Աղավնիները\n\n\n\n");
                		
				//1
				
				printf("Կանգնած եմ Պարթենոնի մարմարների վրա, հենված խորտակված մի սյունի։\n");
                		printf("Հանկարծ փիրուզյա ֆոնի վրա է բարձրանում սպիտակ աղավնիների մի երամ։\n");
                		printf("Կաթնագույն աղավնիներն են, որոնք գալիս, թառում են արձանների վրա, ապա նորեն թռչում են, փիրուզյա երկնքի և ծովի միջև դարձդարձիկ պար դառնալով։\n");
                		printf("Ջինջ օդում կարկաչում է նրանց մրմունջը։\n");
				printf("Այդ կաթնագույն աղավնիները հիշեցնում են ինձ մի հի՜ն տրագեդիա։\n\n");
				
				//2

				printf("Այն երկիրը, որտեղ տեղի է ունեցել այդ տրագեդիան, մի երկիր է արևի բոլոր գույներով վառվող ծաղիկներով և մրգերով, մի երկիր՝ շրջապատված կապույտ սարերով։\n\n");
				
				//3
				
				printf("Այն հին երկրում աղավնիներ պահելը, «աղվընիկ խաղցնելը», ինչպես բնիկներն էին կոչում, համարվում էր ստոր զբաղմունք։\n");
				printf("Ծերերն ասում էին․ «Աղվընիկն անմեղ է, բայց մահ է»։\n");
				printf("Մինչև անգամ, երբ աղավնի էին տեսնում երազում, սարսափում էին նրանք։\n");
				printf("Ամեն անգամ, երբ մայրս տեսնում էր աղավնին մեր կտուրի վրա իջած, ահով էր բռնվում։\n");
				printf("-Աղվընիկը տեներին վրե է նստեր,֊ ասում էր և խաչակնքում դողահար։\n");
				printf("Հին այդ երկրում որևէ մեկին անարգելու համար «աղվընիկ խաղցնող» էին կանչում, եթե մինչև անգամ աղավնիների հետ կապ էլ չունենար։\n");
				printf("Իսկ իսկական աղվընիկ խաղցնողին մատով էին ցույց տալիս, ինչպես պոռնիկին և գողին։\n");
				printf("Ո՛չ միայն աղվընիկ խաղցնողին և նրա տղին աղջիկ չէին տալիս, այլև որոնում էին մինչև անգամ, թե տղի կամ աղջկա «ճինսին մեջ աղվընիկ խաղցնող եղե՞ր է, թե չէ»։\n");
				printf("Բայց մենք, մանուկներս, սիրում էինք աղավնիները, իսկ աղավնի խաղացնողները մեր աչքում հերոսներ էին։\n");
				printf("Մանուկների համար այդ բոլորն անհասկանալի և տարօրինակ էին։\n");
				printf("Չէ՞ որ եկեղեցում ոսկյա աղավնու բերանից էին կաթեցնում մեռոնը՝ թևաբաց ոսկյա աղավնու։\n");
				printf("Աղավնին գովաբանվում էր, իբրև անմեղության նշան, բոլոր երգերում։\n");
				printf("Եվ մենք սիրում էինք աղավնիները։\n");
				printf("Ինձ այրում էր մի տենչանք․ ուզում էի, որ ծնողներ չունենայի, լինեի որբ, բոլորովին ազատ և դառնայի աղվընիկ խաղցնող։ Հրդեհում էր ինձ այդ ցանկությունը։\n\n");
				
				//4
				
				printf("Եվ ամեն օր բարձրանում էի կտուրը, որպեսզի դիտեմ Ակոբի աղավնիները։ Ակոբը, աղվընիկ խաղցնող Ակոբը, մեր հարևանն էր, որ մոտավորապես հարյուր թև աղավնի ուներ։\n");
				printf("Կտուր էի բարձրանում գաղտնի, որ ոչ ոք չիմանա։ Ամոթ էր մեր ընտանիքի որևէ անդամի համար, թեկուզ ինձ նման աննշան անդամի, բարձրանալ կտուրը՝ դիտելու աղվընիկ խաղցնող Ակոբի աղավնիները։\n");
				printf("Ես չէի կարողանում հասկանալ, թե ինչո՞ւ էին անարգում, անպատվում աղվընիկ խաղցնողներին, մանավանդ, աղվընիկ խաղցնող Ակոբին։\n");
				printf("Աղավնիները մահ էին, չա՜ր, ս՜և մահ։\n");
				printf("Ես երբեք չէի կարող հասկանալ մթին այս առեղծվածը։\n");
				printf("«Աղվընիկ խաղցուց, տունը մոխիր դարձավ»,֊ ասում էին հին մի աղվընիկ խաղցնողի մասին։\n\n");

				//5

				printf("Աղվընիկ խաղցնողները մշտական կռվի մեջ էին։ Երբ նրանք տեսնում էին աղավնիներ օդում ճախրելիս՝ բաց էին թողնում իրենց լավագույն աղավնին, որպեսզի գնա, նրանցից մեկն ու մեկը քաշի, բերի։\n");
				printf("Աղավնիների այդ պայքարի ժամանակ երկու աղավնիների տերերը, տարբեր կտուրների վրա, բռնվում էին անսահման անձկությամբ։\n");
				printf("Մինչև պայքարի վախճանը նրանք ապրում էին կես հոգեվարք։ Մութը պատում էր նրան, որի աղավնին, հմայված մյուսից՝ գնում էր նրա հետևից։\n");
				printf("Դրանից սկսվում էր մահացու թշնամությունը, մինչև արյուն, մինչև մահ։\n");
				printf("Պարտված աղավնու տերը զգում էր իրեն ցեխի մեջ տրորված, անպատվված։ Նրա համար նախընտրելի էր, որ կնոջը բռնեին բոզության մեջ, խայտառակվեր ամբողջ քաղաքում, քան թե պարտվեր աղավնիների պայքարում։\n");
				printf("Թշնամությունը տևում էր սերնդից֊սերունդ, չէր մոռացվում ահավոր անպատվությունը։\n");
				printf("Եվ հաճախ պարտված աղավնու տերը, չհամբերելով մինչև անգամ մի օր անցնի և պատահարը դառնա պատմություն, գալիս կանգնում էր հաղթանակող աղավնու տիրոջ տան շեմքին։ Փայլում էր դանակը։\n");
				printf("Դանակները զարկվում էին իրար, նրանց զիլ և սուր զրնգոցը ճեղքում էր օդը՝ իրարանցում, խռնվում, քաշքշոց, շորերի պատառոտում, կանանց և երեխաների լաց, և հոսում էր արյունը մեկն ու մեկից։\n");
				printf("Եթե պարտվող աղավնու տերն էր արյուն թափողը, ամիսներով նրան չէր կարելի տեսնել քաղաքի փողոցներում։ Նա փակվում էր տանը, լուսամուտների վարագույրները քաշած։\n");
				printf("-Կնկանը վարտիքն է մտեր, դուրս չելլար,— ասում էին նրա հակառակորդները։\n");
				printf("Իսկ եթե հաղթանակող աղավնու տերն էր արյուն թափողը, վերքը կապելուց հետո դուրս էր գալիս փողոց, գլուխը բարձր բռնած, ֆեսը հասցրած մինչև հոնքերը և ծոպն առաջ,\n");
				printf("ամենագոռոզ և ամենալկտի ֆես դնելու ձևը, քայլում էր ոչ ոքինչբարևելով, ոչ ոքի երեսին մտիկ չանելով, ռազմի դաշտից վերադարձած արյունարբու հերոսի նման։\n");
				printf("Ահա թե ինչու ծերերն ասում էին՝ աղվընիկն անմեղ է. բայց մահ է։ Աղավնու կաթնագույն թևերի տակ արյուն կար և մահ։\n");
				printf("Բայց այդ զարհուրանքից և արյունից հետո էլ իմ հոգին ձգտում էր դեպի աղավնիները։\n");
				printf("Երբ փողոցում դանակներն էին շողում և ատելությամբ զարկվում իրար ու շաչում, վերևում, պաղպաջուն և կապույտ երկնքում, աղավնիները շարունակում էին ճախրել և դառնալ իրենց անմեղության պարը։\n");
				printf("Ի՞նչ կապ ունեին աղավնիները մարդկանց պատվի, դիրքի և չարության հետ։ Նրանք ճախրում էին արևի շողերի ծովում, շողերի հեշտագին ալիքներում,\n");
				printf("ի՜նչ փույթ, թե ներքևում մարդիկ արյուն էին թափում և թափված արյան հանցանքը փաթաթում իրենց սպիտակ և անմեղ վզերին։\n\n");
				
				//6
				
				printf("Մեր հարևան աղվընիկ խաղցնող Ակոբը արհեստով սափրիչ էր։\n");
				break;
                	}
        	}
    	}
	return 0;
}
