#include <stdio.h>

#ifdef _WIN32
    #include <windows.h>
    void delay_s(int seconds) {
        Sleep(seconds * 1000);
    }
#else
    #include <unistd.h>
    void delay_s(int seconds) {
        sleep(seconds);
    }
#endif

void clear_input_buffer() {
	int c;
    	while ((c = getchar()) != '\n' && c != EOF);
}

typedef enum {
    	START,
    	PART_9,
	PART_9_Q,
	PART_9_1,
	PART_9_2,
	PART_9_2_Q,
	ERROR,
	END
} state;

int main() {
	state current_state = START;
	state last_state = current_state;
    	while (current_state != END) {
        	switch (current_state) {

            		case START: {
				last_state = current_state;
                		printf("\nՍիրելի՛ ընթերցող, քեզ ենք ներկայացնում մեր նախագիծը, որը քեզ թույլ կտա փոփոխություններ կատարել Վահան Թոթովենցի «Աղավնիներ» վիպակի մեջ՝ ստեղծելով «Աղավնիների» քո տարբերակը։\n\n");
                		printf("Պատրա՞ստ ես։ Սեղմի՛ր ցանկացած ստեղն խաղը սկսելու համար\n\n");
                
                		char a = getchar();
				clear_input_buffer();
				current_state = PART_9;
               			break;
            		}
			
			case ERROR: {
				printf("\nՕ՛յ, ցավոք ինչ որ սխալ տեղի ունեցավ։ Մի փոքր սպասի՛ր և կրկին փորձի՛ր։\n\n\n");
				current_state = last_state;
				delay_s(5);
				break;
			}

            		case PART_9: {
                		printf("\n\n\nԸնթերցողի Աղավնիները\n\n\n\n");
                		
				//1
				
				printf("Կանգնած եմ Պարթենոնի մարմարների վրա, հենված խորտակված մի սյունի։\n");
                		printf("Հանկարծ փիրուզյա ֆոնի վրա է բարձրանում սպիտակ աղավնիների մի երամ։\n");
                		printf("Կաթնագույն աղավնիներն են, որոնք գալիս, թառում են արձանների վրա, ապա նորեն թռչում են, փիրուզյա երկնքի և ծովի միջև դարձդարձիկ պար դառնալով։\n");
                		printf("Ջինջ օդում կարկաչում է նրանց մրմունջը։\n");
				printf("Այդ կաթնագույն աղավնիները հիշեցնում են ինձ մի հի՜ն տրագեդիա։\n\n");
				
				//2

				printf("Այն երկիրը, որտեղ տեղի է ունեցել այդ տրագեդիան, մի երկիր է արևի բոլոր գույներով վառվող ծաղիկներով և մրգերով, մի երկիր՝ շրջապատված կապույտ սարերով։\n\n");
				
				//3
				
				printf("Այն հին երկրում աղավնիներ պահելը, «աղվընիկ խաղցնելը», ինչպես բնիկներն էին կոչում, համարվում էր ստոր զբաղմունք։\n");
				printf("Ծերերն ասում էին․ «Աղվընիկն անմեղ է, բայց մահ է»։\n");
				printf("Մինչև անգամ, երբ աղավնի էին տեսնում երազում, սարսափում էին նրանք։\n");
				printf("Ամեն անգամ, երբ մայրս տեսնում էր աղավնին մեր կտուրի վրա իջած, ահով էր բռնվում։\n");
				printf("― Աղվընիկը տեներին վրե է նստեր,― ասում էր և խաչակնքում դողահար։\n");
				printf("Հին այդ երկրում որևէ մեկին անարգելու համար «աղվընիկ խաղցնող» էին կանչում, եթե մինչև անգամ աղավնիների հետ կապ էլ չունենար։\n");
				printf("Իսկ իսկական աղվընիկ խաղցնողին մատով էին ցույց տալիս, ինչպես պոռնիկին և գողին։\n");
				printf("Ո՛չ միայն աղվընիկ խաղցնողին և նրա տղին աղջիկ չէին տալիս, այլև որոնում էին մինչև անգամ, թե տղի կամ աղջկա «ճինսին մեջ աղվընիկ խաղցնող եղե՞ր է, թե չէ»։\n");
				printf("Բայց մենք, մանուկներս, սիրում էինք աղավնիները, իսկ աղավնի խաղացնողները մեր աչքում հերոսներ էին։\n");
				printf("Մանուկների համար այդ բոլորն անհասկանալի և տարօրինակ էին։\n");
				printf("Չէ՞ որ եկեղեցում ոսկյա աղավնու բերանից էին կաթեցնում մեռոնը՝ թևաբաց ոսկյա աղավնու։\n");
				printf("Աղավնին գովաբանվում էր, իբրև անմեղության նշան, բոլոր երգերում։\n");
				printf("Եվ մենք սիրում էինք աղավնիները։\n");
				printf("Ինձ այրում էր մի տենչանք․ ուզում էի, որ ծնողներ չունենայի, լինեի որբ, բոլորովին ազատ և դառնայի աղվընիկ խաղցնող։ Հրդեհում էր ինձ այդ ցանկությունը։\n\n");
				
				//4
				
				printf("Եվ ամեն օր բարձրանում էի կտուրը, որպեսզի դիտեմ Ակոբի աղավնիները։ Ակոբը, աղվընիկ խաղցնող Ակոբը, մեր հարևանն էր, որ մոտավորապես հարյուր թև աղավնի ուներ։\n");
				printf("Կտուր էի բարձրանում գաղտնի, որ ոչ ոք չիմանա։ Ամոթ էր մեր ընտանիքի որևէ անդամի համար, թեկուզ ինձ նման աննշան անդամի, բարձրանալ կտուրը՝ դիտելու աղվընիկ խաղցնող Ակոբի աղավնիները։\n");
				printf("Ես չէի կարողանում հասկանալ, թե ինչո՞ւ էին անարգում, անպատվում աղվընիկ խաղցնողներին, մանավանդ, աղվընիկ խաղցնող Ակոբին։\n");
				printf("Աղավնիները մահ էին, չա՜ր, ս՜և մահ։\n");
				printf("Ես երբեք չէի կարող հասկանալ մթին այս առեղծվածը։\n");
				printf("«Աղվընիկ խաղցուց, տունը մոխիր դարձավ»,֊ ասում էին հին մի աղվընիկ խաղցնողի մասին։\n\n");

				//5

				printf("Աղվընիկ խաղցնողները մշտական կռվի մեջ էին։ Երբ նրանք տեսնում էին աղավնիներ օդում ճախրելիս՝ բաց էին թողնում իրենց լավագույն աղավնին, որպեսզի գնա, նրանցից մեկն ու մեկը քաշի, բերի։\n");
				printf("Աղավնիների այդ պայքարի ժամանակ երկու աղավնիների տերերը, տարբեր կտուրների վրա, բռնվում էին անսահման անձկությամբ։\n");
				printf("Մինչև պայքարի վախճանը նրանք ապրում էին կես հոգեվարք։ Մութը պատում էր նրան, որի աղավնին, հմայված մյուսից՝ գնում էր նրա հետևից։\n");
				printf("Դրանից սկսվում էր մահացու թշնամությունը, մինչև արյուն, մինչև մահ։\n");
				printf("Պարտված աղավնու տերը զգում էր իրեն ցեխի մեջ տրորված, անպատվված։ Նրա համար նախընտրելի էր, որ կնոջը բռնեին բոզության մեջ, խայտառակվեր ամբողջ քաղաքում, քան թե պարտվեր աղավնիների պայքարում։\n");
				printf("Թշնամությունը տևում էր սերնդից֊սերունդ, չէր մոռացվում ահավոր անպատվությունը։\n");
				printf("Եվ հաճախ պարտված աղավնու տերը, չհամբերելով մինչև անգամ մի օր անցնի և պատահարը դառնա պատմություն, գալիս կանգնում էր հաղթանակող աղավնու տիրոջ տան շեմքին։ Փայլում էր դանակը։\n");
				printf("Դանակները զարկվում էին իրար, նրանց զիլ և սուր զրնգոցը ճեղքում էր օդը՝ իրարանցում, խռնվում, քաշքշոց, շորերի պատառոտում, կանանց և երեխաների լաց, և հոսում էր արյունը մեկն ու մեկից։\n");
				printf("Եթե պարտվող աղավնու տերն էր արյուն թափողը, ամիսներով նրան չէր կարելի տեսնել քաղաքի փողոցներում։ Նա փակվում էր տանը, լուսամուտների վարագույրները քաշած։\n");
				printf("― Կնկանը վարտիքն է մտեր, դուրս չելլար,— ասում էին նրա հակառակորդները։\n");
				printf("Իսկ եթե հաղթանակող աղավնու տերն էր արյուն թափողը, վերքը կապելուց հետո դուրս էր գալիս փողոց, գլուխը բարձր բռնած, ֆեսը հասցրած մինչև հոնքերը և ծոպն առաջ,\n");
				printf("ամենագոռոզ և ամենալկտի ֆես դնելու ձևը, քայլում էր ոչ ոքինչբարևելով, ոչ ոքի երեսին մտիկ չանելով, ռազմի դաշտից վերադարձած արյունարբու հերոսի նման։\n");
				printf("Ահա թե ինչու ծերերն ասում էին՝ աղվընիկն անմեղ է. բայց մահ է։ Աղավնու կաթնագույն թևերի տակ արյուն կար և մահ։\n");
				printf("Բայց այդ զարհուրանքից և արյունից հետո էլ իմ հոգին ձգտում էր դեպի աղավնիները։\n");
				printf("Երբ փողոցում դանակներն էին շողում և ատելությամբ զարկվում իրար ու շաչում, վերևում, պաղպաջուն և կապույտ երկնքում, աղավնիները շարունակում էին ճախրել և դառնալ իրենց անմեղության պարը։\n");
				printf("Ի՞նչ կապ ունեին աղավնիները մարդկանց պատվի, դիրքի և չարության հետ։ Նրանք ճախրում էին արևի շողերի ծովում, շողերի հեշտագին ալիքներում,\n");
				printf("ի՜նչ փույթ, թե ներքևում մարդիկ արյուն էին թափում և թափված արյան հանցանքը փաթաթում իրենց սպիտակ և անմեղ վզերին։\n\n");
				
				//6
				
				printf("Մեր հարևան աղվընիկ խաղցնող Ակոբը արհեստով սափրիչ էր։\n");
				printf("Նա այդ արհեստին օրվա քիչ ժամանակն էր նվիրում, որովհետև գրեթե միշտ կտուրի վրա էր, աղավնիներ էր թռցնում, ետ կանչում, նորեն բաց թողնում,\n");
			       	printf("հետևում յուրաքանչյուր աղավնու թռիչքին, հետևում սրտատրոփ, անձկագին։\n");
				printf("Ակոբը թեև լավ ածիլող, մաքրասեր սափրիչ էր, բայց սակավաթիվ հաճախորդներ ուներ, որովհետև հաճախորդ վաստակելու ջանք չէր թափում։\n\n");

				//7

				//8

				printf("Ակոբի կնոջ սիրտը ուրիշ վերք էր կրծում, նա դանակից վախեցողը չէր, շատ էր տեսել, տեսել էր և ամուսնու արյուն թափելը, շատ անգամ էր նրա վերքը կապել։\n");
				printf("Կինը մտածում էր այն մասին, որ աղջիկը մեծացել էր, և եթե ամուսինը ձեռք չքաշեր աղվընիկ խաղցնելուց, սիրուն աղջիկը տանն էր մնալու։\n");
				printf("Առհասարակ, երբ աղավնի խաղցնողները հասակնին առնում էին, թողնում էին աղավնիները։Մինչև անգամ շատերը թողնում էին ամուսնությունից անմիջապես հետո։\n");
				printf("Բայց ոչ մի հույսի նշույլ չէր երևում, որ Ակոբը թողներ աղավնիները և խաղաղ զբաղվեր իր արհեստով։\n");
				printf("Ակոբը ցնցվում էր, մարմինը փուշ֊փուշ լինում, երբ կինն աղջիկ զավակի խոսքն էր անում։\n");
				printf("֊ Նորեն սկսար վռվռալ, հերի՜ք է, մաշեցի՛ր։\n");
				printf("Կանչում էր աղջկան՝ Լիլոյին, դիտում նրա հասակը, ձմերուկի կտերի նման սև աչքերը, թշերի կարմիրը, նստեցնում ծնկանը, շոյում մազերը և արցունքոտ աչքերով շշնջում.\n");
				printf("― Գըզը՜մ չինար բոյլի գըզը՜մ...\n\n");

				//9
				
				printf("Մի օր լուր տարածվեց քաղաքում, որ Հաջի Թումաս աղայի տղան՝ Արան «սեր էր կապել» աղվընիկ խաղցնող Ակոբի աղջկան։\n");
				printf("Լուրն ապշեցուցիչ էր. հուզվել էր ամբողջ քաղքենիությունը, աղաների ընտանիքները, մեծից մինչև փոքրը։\n");
				printf("― Ծո՛, աղվընիկ խաղցնողի աղջիկը կսիրե, դիվանա է,— ասում էին։— Սև մաղեցին տան վրա,— ասում էին ուրիշները։\n");
				printf("Արան՝ Հաջի Թումաս աղայի միջնակ որդին, նոր էր եկել Ստամբոլից, մոտ քսանհինգ տարեկան մի երիտասարդ էր։\n"); 
				printf("Արան մանկուց էր կապվել Լիլոյին, միասին խաղացել էին, միասին բարձրացել էին կտուրը և աղվընիկ բռնել, շոյել և սիրել։\n");
				printf("Իհարկե, տասը տարի մնալով Ստամբոլում, Արան մոռացել էր Լիլոյին, մինչև անգամ աղջկա դիմագծերն անհետացել էին նրա հիշողությունից,\n");
				printf("բայց վերադարձից երկու օր հետո, երբ տեսել էր նրան, կրակվել էր, բռնվել այնպիսի հրդեհով, որից ազատվելն անկարելի դարձավ։\n");
				printf("Եվ մի քանի օր հետո տեսել էին Արային իրենց պարտեզի պատերի վրայից, կես֊գիշերին, Լիլոյենց պարտեզը ցատկելիս, Լիլոն ծառի տակ։\n");
				printf("Լուսնի լույս։ Խաղաղ, անհուն, կապույտ գիշեր։ Ահավոր տեսարան. Արան գրկել էր Լիլոյին, համբուրել, խոսել հետը երկար։\n\n\n\n");
				
				current_state = PART_9_Q;
			}

			case PART_9_Q: {
				last_state = current_state;
				printf("Ահա, սիրելի՜ ընթերցող, ժամանակն է քո խոսքն ասես այս պատմության վերաբերյալ և ինքդ որոշես հերոսների ճակատագրերը։\n");
				printf("Ինչ ես կարծում, արդարացի՞ էր Արայի ընտանիքի բացասական վերաբերմունքը իրենց տղայի և աղվընիկ խաղցնողի դստեր սիրո հանդեպ։\n\n\n");
				printf("Տարբերակ 1։ Այո, Արայի և Լիլոյի սերը արժանիորեն պետք է դատապարտվեր Արայի ընտանիքի կողմից։\n\n");
				printf("Տարբերակ 2։ Ոչ, Արայի ընտանիքը պետք է ընդունի Արայի սերը և ընդառաջ չգնա հասարակության կարծրատիպերին։\n\n");
				printf("Տարբերակներից մեկը ընտրելու համար սեղմիր տարբերակի համապատասխան համարը (1 կամ 2)\n\n");
				
				char b = getchar();
				clear_input_buffer();
        			if (b == '1') {
					current_state = PART_9_1;
					break;
        			} else if (b == '2') {
            				current_state = PART_9_2;
					break;
        			} else {
					current_state = ERROR;
					break;
				}
				break;
                	}
				     
			case PART_9_1: {
				printf("Արայի ընտանիքն ամենաուշը լսեց զարհուրելի իրողությունը․ իրենց տղան աղվընիկ խաղցնողի աղջկա հետ... Մութ, դժոխային իրողություն։\n");
				printf("Արայի մայրը փակվեց տանը, ոչ եկեղեցի գնաց և ոչ էլ բաղնիս, իսկ Հաջի Թումաս աղան երկու օր խանութ չհաճախեց։ Ստեցին թե՝ «Հաջաղան հիվընդցեր է»։\n");
				printf("Այնինչ նա տանը նստած՝ երկար մտածում էր և երկար խոսում էր կնոջ հետ։\n");
				printf("Հաջի Թումաս աղան սեղանավոր էր՝ փող էր մանրում։ Փող մանրելուց գրեթե վաստակ չկար, այսինքն՝ այնպիսի վաստակ, որից մեծահարուստ կարողանար դառնալ մարդ։\n");
				printf("Այդ առևտուրը նրա համար քող էր միայն։ Մթնում, գաղտնի, նա վաշխառությամբ էր պարապում։\n");
				printf("Բոլոր փոքր առևտրականները նրան պարտք ունեին, պարտք, որ ամեն տարի աճում էր, բոլոր կանանց գոհարները պահ էին տրված Հաջի Թումասին, նա ձեռքի տակ ուներ հողեր, ագարակներ և տներ, իբրև գրավական։\n\n");
				
				//10

				printf("Ակոբը ոչ մի լուր չուներ Լիլոյի և Արայի հարաբերությունների մասին։ Նրա հետ շատ քչերն էին խոսում և կապ պահում։ Իսկ Ակոբն էլ միայն զբաղված էր աղավնիներով։\n");
				printf("Նա բարեկամ էր միայն աղավնիներին և մանուկներին։ Բայց կինը գիտեր Լիլոյի սիրո մասին և պարտականություն համարեց ասել ամուսնուն, չթաքցնել նրանից, վերջապես հայրն էր, իրավունք ուներ իմանալու։\n");
				printf("― Լիլոյիս բախտը վարդի պես բացվավ, աստված էրեսը նայեցավ,―վերջացրեց մայրն իր պատմությունը։\n");
				printf("― Աղջի՛, սուտ կխոսաս, հա՜,― հարեց Ակոբն ուրախությունից։\n");
				printf("― Լիլոյիս թաղեմ,― երդվեց մայրը։\n");
				printf("― Փա՜ռք քըզի, աստվա՜ծ, ճերմակ աղվընկաս պահապան եղիր,― վերջացրեց Ակոբը։\n");
				printf("Մի գիշեր Արան մի մատանի դրեց Լիլոյի մատը։ Լիլոն համբուրեց մատանին և շշնջաց.\n");
				printf("― Ստամբոլ երթանք, դնիմ մատս։\n");
				printf("― Ինչո՞ւ հիմա չես դներ,― հարցրեց Արան։\n");
				printf("― Հայրս կտեսնա, աղեկ չէ,― պատասխանեց Լիլոն։\n");
				printf("Մատանիի նվերից հետո Լիլոն երեք օր նստեց տանը, սեխի կուտ փռճեց, հետո աղով բովեց և սպիտակ տոպրակի մեջ լցրաձ՝ տարավ գիշերը բաղչան, տվեց Արային.\n");
				printf("― Ուրիշ բան չունիմ.֊ շշնջաց Լիլոն ամաչկոտ։\n");
				printf("Արան համբուրեց նրան և միասին կերան ու խոսեցին։\n");
				printf("Մի օր էլ Լիլոն մորը խնդրեց, որ մի աղավնի մորթի, կարմրեցնի, որպեսզի, երբ Արան գա, նրան հյուրասիրի.\n");
				printf("― Հայրդ իմանա, մեզի կկախե,― պատասխանեց մայրը, բայց և մտքում որոշեց ասել Ակոբին, թերևս զիջի և կատարված լինի Լիլոյի ցանկությունը։ Ակոբն անմիջապես ընդառաջ գնաց.\n");
				printf("― Իմ բյուդուն աղվընիկներս Լիլոյիս ղուրբան կենիմ։\n");
				printf("Լիլոն կարմրած աղավնին փաթաթեց սպիտակ լավաշի մեջ, մայրը տվեց նրան իր սնդուկի մի անկյունում հնուց պահված մի մետաքսյա թաշկինակ։\n");
				printf("Լիլոն ծրարեց աղավնին ու լավաշն այդ թաշկինակի մեջ, և երբ Արան եկավ պարտեզ, բաց արավ և հյուրասիրեց նրան աղավնու թանկագին մսով։\n\n");

				//11
				
				printf("Այսպես Լիլոն ապրում էր իր կյանքի երջանիկ օրերը։ Նրա հետ միասին և նրա ծնողները, տեսնելով իրենց աղջկա բախտավորությունը։\n");
				printf("Երջանկության այդ օրերին Լիլոյին տանջում էր մի բան. բոլորը, բոլորը հորն անպատվելու համար հայհոյում էին իրեն, հայհոյում էին ամենալկտի կերպով։\n");
				printf("Երբ աղվընիկ խաղցնողն ամուրի էր, իրեն էին հայհոյում, երբ կին ուներ, կնոջն էին հայհոյում, իսկ երբ աղջիկ ուներ՝ աղջկան։\n");
				printf("Հաջի Թումաս աղայի որդու դեպքն առիթ դարձավ, որ հայհոյանքներն ավելի սաստկանան, ստանան ավելի թանձրացյալ գույն, ավելի լկտի, ավելի պատկերավոր։\n");
				printf("Լիլոյի խեղճ մայրն ընկավ ամուսնու հետևից։ Մոր համար անլուծելի պրոբլեմ էր հասած աղջիկը տանը։\n");
				printf("― Ա՛յ մարդ, քիչ մը մտմտա՛, մեղք է աղջիկս։ Աստված, երթայի Ստամբոլ, մուրայի ու ապրեի։\n");
				printf("Իհարկե աղջկան ուզողներ կային, բայց բոլորն էլ աղվընիկ խաղցնողներ էին, իսկ Լիլոյի ծնողները երդվել էին, որ նրան աղվընիկ խաղցնողի չտան։\n");
				printf("Ակոբը առանձին սիրով էր սիրում աղջկան։ Այն օրից, երբ կնոջից լսեց նրա բախտավորությունը, ապրում էր երջանկության մեջ։ Աղջկա պսակից հետո, մտածում էր նա, չկար ոչ մի արգելք իր կյանքի ճանապարհին,\n");
				printf("նա կարող պիտի լիներ ֆեսը ծռել ու ման գալ, էլ աղջիկ չուներ, որին հայհոյեին, էլ աղջիկ չուներ, որի տանը մնալը տանջանք պատճառեր, կարող էր ամբողջովին նվիրվել աղավնիներին...\n\n");

				//12
				
				printf("Հաջի Թումաս աղան որոնեց Արայի աչքին Լիլոյին վարկաբեկելու բոլոր միջոցները, երբ որդին գրոշի արժեք չտվեց Լիլոյի հոր աղվընիկ խաղցնելու հանգամանքին։\n");
				printf("Հաջի Թումաս աղան իր մոտ կանչեց Արայի պառավ մորաքրոջը, իր քենուն, նրան տվեց մի քուրք և պատվիրեց հայտնել մի կերպ Արային, որ տեսել է բաղնիսում Լիլոյին, փորի ու մեջքի վրա ամբողջ վերք։\n");
				printf("Արայի մորաքույրը, չար մի պառավ, չեչոտ երեսի համար ամուրի մնացած, ամբողջ կյանքում ոչ մի տղամարդ ոչ մի րոպեով չէր սեղմել նրան իր կրծքին,\n");
			       	printf("կրկնապատկեց իր ատելությունը դեպի ջահել և սիրուն կանայք ու, գնալով Արայի մոտ, սկսեց նրա մեջ կասկած մցնել։");
				printf("Այդ իրիկուն իսկ Արան, Լիլոյին գրկելիս, տարօրինակ կերպով ձեռքը տարավ նրա փորին և ուժգին սեղմեց մեջքը։ Լիլոն իրեն վերք ունեցողի նման չպահեց, բայց նրան տարօրինակ թվացին Արայի այդ իրիկվա ձևերը։\n");
				printf("― Ըսե, ի՞նչ կա, ի՞նչ ես լսել։\n");
				printf("Արան հայտնեց անկեղծորեն լսածը, որից պարզվեց Լիլոյի համար, թե ինչո՞ւ սեղմեց մեջքը և ձեռքը տարավ վարին, մի բան, որ երբեք նա չէր փորձել դրանից առաջ։\n");
				printf("Լիլոն չպատասխանեց, աչքերը տխուր հառեց Արայի վրա և սիրտը փլվեց, սկսեց հեկեկալ և, փախչելով Արայի գրկից, մտավ տուն։\n");
				printf("Մայրը նրան սպասում էր քնաթաթախ աչքերով, պարտեզի դռան հետևում, աղորիքի քարի վրա նստած։ Լիլոն ընկավ նրա գիրկը, արցունքների մեջ խեղդված։\n");
			       	printf("Խեղճ մայրը պատճառը հարցրեց, բայց Լիլոն ոչինչ չկարողացավ ասել, բուռն արցունքները խեղդեցին նրա կոկորդը։ Մայրը վազեց դուրս։ Արան դեռևս կանգնած էր ծառի տակը, մտամոլոր և տխուր։\n");
				printf("― Աչքիս լույսը, Լիլոյին ինչո՞ւ ես լացուցեր։\n");
				printf("Արան պատմեց եղելությունը և ավելացրեց.\n");
				printf("― Ես չեմ հավտար, բայց Լիլոն չըսավ, թե սուտ կսեն։\n");
				printf("Լիլոյի մայրը բռնեց Արայի ձեռքը հարազատ մոր նման, համբուրեց նրան և խաչ հանելով՝ շշնջաց.\n");
				printf("― Օղո՛ւլ, էդպես բան չկա, լուսնկայի պես մարմին ունի, աչքս քոռնա, որ սուտ ըսեմ, թե չես հավտար՝ պսակի երթալեն առաջ չպլխցնիմ, տե՛ս։\n");
				printf("Արան գրկեց Լիլոյի մորը և ողողեց նրան համբույրներով։ Միասին առաջացան դեպի պարտեզի դուռը։ Մայրը մտավ ներս և դուրս բերեց Լիլոյին։ Լիլոն փաթաթվեց Արային։\n");
				printf("― Շուտով քեզ տանիմ Ստամբոլ, խալըսինք էս կրակեն։\n");
				printf("― Հա, օղո՛ւլ, հա՛, տար,― շշնջաց մայրը։\n\n");

				//13
				
				printf("Մի օր էլ, հուսահատված բոլոր միջոցներից՝ Հաջի Թումաս աղան իր մոտ կանչեց աղվընիկ խաղցնող Ակոբին։ Ակոբն ուզում էր չգնալ, կինն աղաչեց որ գնա։\n");
				printf("Իհարկե, նա զգում էր, որ մի լավ բանի համար չէր կանչում իրեն։ Այնուամենայնիվ, պիտի գնար։ Ակոբը միտքը դրեց համբերատար լինել, իրեն չկորցնել։\n");
				printf("— Աղջի՛, մեյ մը երթամ, աչքին դպնամ, տեսնեմ ի՞նչ կըսե,― հայտարարեց Ակոբը ու գնաց։\n");
				printf("— Ակո՛բ,— սկսեց հարուստ Հաջի Թումասը գոռոզ տոնով,— քիչ մը աղջիկդ պահե, ամո՛թ է։\n");
				printf("Ակոբը չհամբերեց, հարուստի գոռոզությունը զայրացրեց նրան, բերանը բաց արավ.\n");
				printf("— Իմ աղջիկս բոզ չէ, որ ամչնամ, դուն քու ճերմակ մազերեդ ամչցիր։\n");
				printf("— Դուն իմ այերի մարդ չես, որ հետդ խնամություն էնիմ, էս մեկը հասկցիր։\n");
				printf("— Շիտակ ես, Հաջի աղա, դու ինձմե շատ ցած ես,— պատասխանեց Ակոբը և դառն ծիծաղեց։\n");
				printf("— Մեծ տղադ Սամսոնեն բոզ բերեց, որու՞ կկլլեցնես, բոլոր արաբաջիները գիտեն, բերանս բանալ մի՛ տար, փա՜ռք աստծո, աղջիկս սուրբ է, անոր վյուջուդը էրիկ մարդ դահա չի տեսեր։\n");
				printf("Հաջի Թումասը տեղեկություն ուներ այդ մասին, բայց քանի որ քաղաքում չէին բամբասում, լռել էր և հաշտվել իրողության հետ։ Հաջի Թումասը զգաց, որ աստծո կրակը կարող է թափվել ամբողջ տան վրա,\n");
				printf("Ակոբի բերանը ոչ ոք չէր կարող փակել, ուստի նրան փող առաջարկեց, որ լռի։\n");
				printf("— Ես քեզմե հարուստ եմ, փարադ քըզի պահե, բերանս որ չեմ բանար, Արայի ազիզ խաթեր համար է,— պատասխանեց Ակոբը և դուրս ելավ։\n");
				printf("Հաջի Թումաս աղան չդադարեց պայքարելուց մի անմեղ աղջկա դեմ։ Մի օր էլ Հաջի Թումասն իր որդուն կանչեց մոտը և առաջարկեց նրան իսկույն ևեթ մեկնել Ստամբոլ։\n");
				printf("— Շատ փարա կուտամ, գնա Ստամբոլ, էնտեղ կարգվիր, երեսս մի՛ տեսնար,— հայտարարեց հայրը:\n");
				printf("Որդին ընդդիմացավ։\n");
				printf("— Հո՛ս պիտի կարգվիմ։\n");
				printf("Հաջի Թումաս աղան զայրացավ, լցվել էր համբերության բաժակը։\n");
				printf("— Դուն իմ տղաս չես, դուն իմ ժառանգը չես,— հայտարարեց անողոք հայրը։\n");
				printf("— Մեկ փարայի կարոտ չեմ,— պատասխանեց որդին և դուրս եկավ տնից։\n");
				printf("Այդ օրվանից Արան այլևս տուն չվերադարձավ։\n");

				//14

				printf("Քաղաքում այս դեպքից հետո բամբասանքն ավելի և ավելի բոցավառվեց, հայհոյանքներն սկսեցին տեղատարափի նման թափվել Լիլոյի հասցեին։\n");
				printf("Լիլոն վեց ամիս էր, ինչ չէր կարողանում բաղնիս գնալ, բոլորն աչքները հառում էին նրա վրա։ Այս բոլորն ազդեցին աղջկա ոչ միայն հոգեկան, այլև մարմնական դրության վրա, օրեցօր սկսեց մաշվել։\n");
				printf("― Տա՛ր ընծի, ուր կուզես տար, ազատե ընծի էս կրակեն,— աղաչում էր Լիլոն Արային։\n");
				printf("Բայց Արայի նախկին ինքնավստահությունը չէր մնացել, փող չուներ, ապրելուդժվարություններ էր քաշում։ Տնից դուրսգալու առաջին օրերն ազգականների մոտ էր ապրում, բայց սրանք էլ երես դարձրին։\n");
				printf("Պարզ էր. դա հոր պայքարի շարունակությունն էր։ Արան ստիպված եղավ փոխադրվել բազարի կեղտոտ խանը և ման գալ քաղաքում կեղտոտված զգեստներով։\n");
				printf("Մի անգամ նա հանդիպեց մորը և գլուխը կախ անցավ, իսկ մայրը հազիվ իրեն գցեց մի մոտիկ ծանոթի տուն, արտասուքների մեջ խեղդված։\n");
				printf("Վերջապես մայրը լուր ուղարկեց, որ փող կտա նրան, թող վերցնի աղջկան և գնա հեռավոր երկիր, իրենց աչքից հեռու։ Արան շատ էր խեղճացել, համաձայնեց.\n");
				printf("Արան եկավ Լիլոյի մոտ թե՝\n");
				printf("— Մայրս խոսք է տվել փարա տա, քեղ առնիմ տանիմ Ստամբոլ։\n");
				printf("Եվ Լիլոն սպասում էր այդ խոստումի կատարման։ Իսկ Ակոբի համար կյանքը դառնում էր անտանելի։ Անցնում էին օրեր ու շաբաթներ, և նա կտուր չէր բարձրանում աղավնիները թռցնելու:\n");
				printf("Լիլոյի համար դառն էր տեսնել, որ իր պատճառով հայրը կորցրեց նախկին երջանկությունը։ Արայի վիճակը մի կողմից, հորը և մորը վիճակը մյուս կողմից՝ մռայլում էին Լիլոյին,\n");
			       	printf("մահացու հարվածներ հասցնում նրա առողջությանը։Ակոբը մի քանի անգամ որոշեց ծախել աղավնիները, ոչնչացնել տուն֊տեղ,\n");
			       	printf("գնալ մի ուրիշ քաղաք, թերևս մի ուրիշ երկիր, որպեսզի մարդիկ մոռանային, թե ինքը եղել էր աղվընիկ խաղցնող, բայց արդեն ուշ էր, որովհետև Լիլոն պաղատում էր.\n");
				printf("— Ընծի մի՛ մորթեր, Արան ու՞ր թողունք էրթանք։\n");
				printf("Իսկ Արան չէր համաձայնում հեռանալ քաղաքից՝ Լիլոյի հոր անձուկ միջոցներով։\n");
				printf("— Քիչ մ՚ալ սպասե, մայրս խոստացեր է։\n");
				printf("Որքան որ Ակոբը որոշում էր ծախել աղավնիները և հեռանալ քաղաքից, բայց սարսափում էր այդ հեռապատկերից։ Վերջապես Ակոբը որոշեց ոչ թե ծախել թռչունները, այլ մորթել, ոչնչացնել։\n");
				printf("Մի առավոտ Ակոբը հայտնվեց կտուրի վրա։ Երկար ժամանակ էր նա կտուր չէր բարձրացել։ Բարձրանալիս Լիլոն տեսավ հորը։ Նա անմիջապես վազեց մոր մոտ, չկարողանալով ոչինչ ասել, փաթաթվեց նրան և սկսեց հեկեկալ։\n");
				printf("— Հայրի՛կը...\n");
				printf("Մայրը վազեց դեպի կտուրը։\n");
				printf("Ակոբը բարձրացավ կտուրը, բաց արավ աղավնիների դռնակը, դուրս թռան աղավնիները, նրանց համերգը տարածվեց օդում, նրանցից շատերը թառեցին Ակոբի վրա, կարծես կարոտել էին։\n");
				printf("Ակոբը հանեց ֆեսը, բռնեց աղավնիներից մեկը, քաշեց դանակը... արյունը ժայթքեց նրա կրծքի սպիտակ շապիկի վրա, բռնեց երկրորդ աղավնին, բայց ձեռքերը թուլացան, դանակն ընկավ գետնին։\n");
				printf("Կինը բարձրացավ կտուրը, չնշմարեց աղավնին, և կարծեց, որ ամուսինը դանակով վիրավորել է կուրծքը։ Կտուրի վրա բարձրացավ աղիողորմ ճիչ։\n");
				printf("Աղվընիկ խաղցնողը, արցունքոտ աչքերով, սեղմեց իր մեկ հատիկ աղջկան իր կրծքին և շշնջաց.\n");
				printf("— Լիլո՛ս, աղվընի՛կս, իմ բյութուն աղվընիկներս ոտքերիդ ղուրբան էնիմ։\n");
				printf("Այս բոլորն աղետալի կերպով անդրադառնում էին Լիլոյի հոգու և ֆիզիկականի վրա։ Նա օրեցօր տժգունում էր, աչքերի ներքևում կամարաձև կապուտցան, նիհարեց, սիրտն արագ֊արագ խփում էր։\n");
				printf("— Սիրտս կուզե դուրս թռի,— ասում էր։\n");
				printf("Իսկ մայրը նրան մխիթարում էր.\n");
				printf("— Ջահելություն է, կանցնի, մի՛ մտմտա։\n");

				//15

				printf("Մի գիշեր Արայի մայրը որոնեց Հաջի Թումաս աղայի գրպանները և գտավ երկաթե սնդուկի բանալին, որտեղ նա պահում էր իր հնչուն դրամը, մուրհակները և առևտրական բոլոր փաստաթղթերը։\n");
				printf("Կինը դողահ որոնեց սունդուկը բաց արեց այն, ամբողջը լցրեց գոգնոցի գրպանը, իջավ սանդուղներից, բաց արավ ածխանոցը, պահեց ոսկիները ածուխների տակ։ Հաջի Թումաս աղան խոր քնած էր։\n");
				printf("Առավոտյան կինը շուտ վեր կացավ, առաջին գործը եղավ փոխել ոսկիների թաքստոցը, և դիտմամբ չզարթեցրեց ամուսնուն, որ ուշանա խանութից և վեր կենալուն պես շտապի դեպի շուկա:\n");
				printf("Արան կեսօրից հետո թակեց պարտեզի դուռը և կանչեց մորը։ Մայրը նրան համբուրեց, լաց եղավ և տվեց ոսկիները։\n");
				printf("— Հարսնիք֊մարսնիք մ՚էներ, աղջիկը առ ու գնա՛, հայրդ ինադի է ընկեր։\n");
				printf("Արան փողը ստանալուց հետո անմիջապես չվազեց Լիլոյի մոտ։ Նա տխուր կանգնեց պարտեզի պարսպի տակ և գլուխը կախեց։ Լիլոն հիվանդ էր։\n");
				printf("Ինչպե՞ս հիվանդ աղջկան վերցներ անկողնից և հեռանար քաղաքից։ Նա քայլեց, դարձավ մյուս փողոցը և կանգ առավ Լիլոյենց պարտեզի դռան առաջ։ Գարունը հորդում էր։\n");
				printf("Արան մտավ Լիլոյի տունը։ Մայրը չէր երևում, գլուխը կոխեց խոհանոցը, այնտեղ էլ չէր։ Բարձրացավ վեր, ոտների ձայնից և սանդուղների ճռնչոցից Լիլոյի մայրը ցատկեց սենյակից դուրս։ Արան ոգևորվեց։\n");
				printf("— Մայրի՛կ,— շշնջաց նա՝ բռնելով Լիլոյի մոր ձեռքը,— փարա ունիմ, կերթանք Ստամթբոլ, բոլորս միասին կերթանք։\n");
				printf("Մայրը չպատասխանեց և ցավագին ժպտաց։ Նրանք միասին մտան սենյակը։\n");
				printf("Լիլոն պառկած էր բաց լուսամուտի առաջ, գարնան արևի շողերը փռվել էին առատությամբ նրա անկողնի վրա։ Արան կանգնեց Լիլոյի անկողնի առաջ, գլխարկը հանեց, նստեց անկողնու վրա և ասաց.\n");
				printf("— Լիլո՛ս, նախշուն խուշս, փարա բերեր իմ, երթանք Ստամբոլ։\n");
				printf("Լիլոյի մարած աչքերը բոցավառվեցին։ Արան անմիջապես ավելացրեց.\n");
				printf("— Բոլորս միասին, հայրիկն ըլ, մայրիկն ըլ։\n");
				printf("Լիլոն ժպտաց, թարմացավ, տժգույն շուրթերի վրա դողաց գարնան շողը։\n");
				printf("— Աղեկնամ, երթանք,— շշնջաց նա։\n");
				printf("Ապա դառնալով մորը՝\n");
				printf("— Մայրի՛կ, աղեկնամ, երթանք Ստամբոլ։\n");
				printf("Մոր արցունքները գլորվում էին այտոսկրների վրայից։\n");
				printf("— Հայրիկն ո՞ւր է,— հարցրեց Լիլոն։\n");
				printf("— Գնաց աղվընիկ ծախե, հեքիմ բերե,— պատասխանեց մայրը գոգնոցի ծայրով քիթը սրբելով։\n");
				printf("— Ես երթամ բերիմ,— հայտարարեց Արան և վազեց դուրս։\n");
				printf("Փողոցում Արան պատահեց Հաջի Թումաս աղին, որ շուկայից էր վերադառնում։ Արան հորը սուտ չտեսնել արավ։ Նա գարշում էր հորից։\n");
			       	printf("Արայի՝ տնից դուրս գնալուց ի վեր՝ Հաջի Թումաս աղան առաջին անգամն էր, որ պատահում էր որդուն։\n");
				printf("Երբ ծառան դուռը բաց արավ, Հաջի Թումաս աղան ընկավ ներս և փռվեց գետնին։ Կինը վազեց, հարսները հավաքվեցին, վերցրին և փոխադրեցին սենյակ։\n");
				printf("— Ի՞նչ ռաստ եկավ,— հարցրեց կինը։\n");
				printf("— Արան դեմս ելավ, աղջի՛կ, խաֆաս դարձավ։\n");
				printf("Արան վազեց «առնավուտ հեքիմի» մոտ։ Մինչև նա վերադարձավ Լիլոյի մոտ բժշկի հետ միասին, այնտեղ գտավ հայ բժշկին, որին Ակոբն էր բերել։\n");
				printf("Երկու բժիշկներն էլ համաձայնեցին, որ Լիլոյի դրությունն անհույս է, ոչ դեղ հարկավոր է և ոչ էլ որևէ փորձ կատարել։ Նրանք պատվիրեցին հանգիստ թողնել հիվանդին, որ իրեն֊իրեն լավանա։\n");
				printf("Ակոբը մոտեցավ աղջկան, շոյեց նրա մազերը բոլորովին հուսադրված, որ Լիլոն լավանալու է, անպայման լավանալու է, բայց մոր արցունքները թափվում էին ցցված այտոսկրներից վար։\n");
				printf("Արան էլ մոտեցավ, բռնեց Լիլոյի ձեռքը և լուռ գլուխը կախեց։\n");
				printf("— Դուք էրկուքդ ըլ իմ աղվընիկներս եք, իրարու պաչեցեք, տեսնամ,— ասաց հայրը։\n");
				printf("Լիլոն ամաչեց։ Արան գլուխը բարձրացրեց և գուրգուրանքով նայեց աղվընիկ խաղցնող Ակոբին, որ ամբողջ կյանքում դանակի հետ էր խաղացել և արյուն թափել։\n");
				printf("— Ձըզի կըսեմ, իրար պաչեցեք, տեսնամ,— պնդեց Ակոբը։\n");
				printf("Լիլոն ու Արան լուռ էին։ Ակոբը բարձրացավ տեղից, բռնեց Արայի գլուխը, մոտեցրեց Լիլոյին։ Նրանք համբուրեցին իրար։\n");
				printf("— Օխ, աղվընիկներս...\n");
				printf("Ակոբն անսահման երանություն էր ապրում, նրա մեջ բոցավառվեց հույս, որ Լիլոն կլավանա, անպայման կլավանա։ Ակոբը մոտեցավ պահարանին, վերցրեց դանակը։\n");
				printf("— Երթամ աղվընիկ մորթիմ Լիլոյիս համար։\n");
				printf("Նա դուրս եկավ սենյակից ուրախ։ Լիլոյի հիվանդությունից առաջացած տարակուսանքը բոլորովին փարատվել էր։ Միամիտ հայրը հուսադրում էր իրեն։\n");
				
				//17

				printf("Երկար ժամանակ անկողնին ծառայելուց հետո Լիլոն սկսեց արագորեն հալվել։\n");
				printf("Եվ մի առավոտ, Լիլոն փակեց աչքերն այնպես, ինչպես կանթեղի ձեթը վերջանում է և պատրույգի բոցը հետզհետե փոքրանում, փոքրանում, առկայծում և հուսկ ապա՝ մարում։\n");
				printf("Այդ առավոտ բարձրացավ աղեկտուր ճիչ Ակոբի խրճիթի վերևի փոքրիկ, արեգդեմ սենյակում։\n");
				printf("— Ճերմակ աղվընիկս թռա՜վ, ճերմակ աղվընիկս թռա՜վ, թռա՜վ,— աղաղակում էր հայրը։\n");
				printf("Արան, գրկած Լիլոյի գլուխը՝ նրա մազերը թրջում էր արցունքով, մինչդեռ մայրը ճչում էր ու մազերը փետում։\n");

				//18

				printf("Երբ փոքրաթիվ հուղարկավորները (բոլորն էլ աղվընիկ խաղցնողներ) դուրս էին բերում Լիլոյի դագաղը, Արան չկարողացավ դիմանալ, ամբողջ հասակով փռվեց սենյակի մեջտեղում,\n");
				printf("մայրը գրկեց Լիլոյի բարձը և խելագար ճիչերով ընկավ նրա անկողնի վրա, իսկ հայրը բարձրացավ կտուրը։\n");
				printf("Նա բաց արավ աղավնիների դռնակը, բռնեց մի զույգ սպիտակ աղավնի և իջավ փողոց։Փողոցում կանգնեց դագաղի առաջ, չոքեց գետնին, թևերը բարձրացրեց մի ձեռքով աղավնիները բռնած,\n");
				printf("վեր առավ գլուխը, նայեց երկնքին, ինչ֊որ շշնջաց, ապա կանգնեց, գոտուց քաշեց դանակը, դագաղի վրա մորթեց զույգ աղավնիկները,\n");
				printf("որոնց արյունը կաթկթեց Լիլոյի տժգույն և սառած դեմքի վրա և, արցունքների մեջ ողողված, բացականչեց.\n");
				printf("— Լիլո՜ս, իմ ճերմակ աղվընի՜կս․․․\n");
				printf("Մորթած աղավնիները տեղավորեց Լիլոյի զույգ քունքերին։\n");
				printf("Փոքրիկ թափորը շարժվեց դեպի գերեզմանոց։\n\n");
				printf("***\n\n");
				printf("Փռվում էր իրիկնային հովը, և երկնքից մաղվում էր մանուշակագույն մոխիր աշխարհի վրա։\n\n\n\n");
				printf("Սիրելի՜ ընթերցող, քո որոշմանը հաջորդեցին նույն գործողություննորը, որոնք տեղի էին ունեցել բնօրինակում։ Կարծես մեր հերոսների ճակատագրերը միայն այս կերպ կարող են դասավորվել։\n\n\n\n");
				
				printf("Ցանականու՞մ ես նորից սկսել խաղը, ապա սեղմիր 1, հակառակ դեպքում՝ ցանկացած այլ նշան։\n\n");

				char c = getchar();
                                clear_input_buffer();
                                if (c == '1') {
                                        current_state = START;
                                        break;
                                } else {
                                        current_state = END;
                                        break;
                                }
                                break;
			}

                        case PART_9_2: {
				printf("GOOD!");
				
				current_state = PART_9_2_Q;
			}
		}
    	}
	return 0;
}
